[
  {
    "path": "posts/2022-06-22-Chicago/",
    "title": "Coffee places in Chicago 2022",
    "description": "How can a good city not have welcoming coffees.",
    "author": [
      {
        "name": "Yiwen Wu",
        "url": {}
      }
    ],
    "date": "2022-06-22",
    "categories": [],
    "contents": "\r\nChicago\r\nhas a good list of coffee shops, a set shopped, and more to\r\ndiscover.\r\nThe trip to Chicago is always fun. Take a peak at following attractve\r\ncoffee shops This list are have-to-go. I tried them, all tasty.\r\nSawada in West Loop\r\n\r\nGoddess and the Baker\r\n\r\nCaffe Umbria\r\n\r\nMojo\r\n\r\nBlue Bottle\r\n\r\nStartbucks Roastery\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-06-22-Chicago/loop.jpeg",
    "last_modified": "2024-08-29T22:28:49-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2018-04-20-community-g/",
    "title": "A Lively Neighborhood? A Project for Improving neighborhood livelyhood in Lawrence, Kansas",
    "description": "Keywords: community garden, canopy, livable, lively neighborhood",
    "author": [
      {
        "name": "Yiwen Wu",
        "url": {}
      }
    ],
    "date": "2018-04-20",
    "categories": [],
    "contents": "\r\nWest Lawrence Greening\r\nProject\r\nWhat can be done on a vacant land? More development for vacant\r\napartment? Or let the land sit and absorb heat, or let soil to rot? Or,\r\na community garden for a livable and lively community?\r\nThis is a story map made through https://storymaps.arcgis.com/en/. The story map\r\ndemonstrates the lack of walkability and canopy in West Lawrence\r\nneighborhoods. More details can be found at https://www.arcgis.com/apps/Cascade/index.html?appid=21536c10fe15412aa449045c9c6b0444.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2024-08-29T21:38:39-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2017-12-01-binet/",
    "title": "A Combinatorial Proof of Binet's Formula",
    "description": "Keywords: combinatorics, counting, Binet's Formula",
    "author": [
      {
        "name": "Yiwen Wu",
        "url": {}
      }
    ],
    "date": "2017-12-01",
    "categories": [],
    "contents": "\r\nBinet’s Formula\r\nThe Binet’s formula is also known as the explicit expression of\r\nn-th term of the Fibbonacci Sequence.\r\nBrief Introduction\r\nCounting is a very basic skill. We have all been learning how to\r\ncount since we were very young. If we think back to our childhood, other\r\nthan simple vocabulary like “daddy” and “mommy”, the most common thing\r\nwas to count the numbers from one to ten. In this case, counting could\r\nbe the first exposure to mathematics for old math traditions. Now, we\r\nstill count in daily life, for instance, money exchange, time\r\nmanagement, fortune accumulation, etc. However, the beauty of counting\r\nis more than that. We can apply the concept of counting in various\r\nmathematical problems and proofs. Binet’s formula, in another name the\r\ngolden ratio, can be proved.\r\nTools\r\nI employed counting’s principle, DIE method by modern mathematician\r\nDoron Zeiberger. Principles in combinatorics are pioneered by modern\r\nmathematician Benjamin and Quinn. Without all knowledge above, there is\r\nno such proof can be exsited. Contact for more information.\r\nAnother version\r\nYou may find this formula and proof useful.\r\nA\r\nProof of Binet’s Formula\r\n\r\n\r\n\r\n",
    "preview": "posts/2017-12-01-binet/binet.png",
    "last_modified": "2024-08-29T21:38:39-05:00",
    "input_file": {},
    "preview_width": 995,
    "preview_height": 626
  }
]
